#+title: Logbook
#+created: 2024-01-19 Fri 13:40:27 GMT
#+modified: <2025-08-25 Mon 15:20:39 BST>

*** Log tail
#+begin_src sh :results value raw output replace :exports results
curl -s https://ci.guix.gnu.org/build/3329277/log/raw | zcat | tail -n20
#+end_src

#+RESULTS:
go build  -o build/nsq_to_nsq ./apps/nsq_to_nsq
go build  -o build/nsq_to_file ./apps/nsq_to_file
go build  -o build/nsq_to_http ./apps/nsq_to_http
go build  -o build/nsq_tail ./apps/nsq_tail
go build  -o build/nsq_stat ./apps/nsq_stat
go build  -o build/to_nsq ./apps/to_nsq
phase `build' succeeded after 15.7 seconds
starting phase `check'
go test: -race is only supported on linux/amd64, linux/ppc64le, linux/arm64, freebsd/amd64, netbsd/amd64, darwin/amd64, darwin/arm64, and windows/amd64
error: in phase 'check': uncaught exception:
%exception #<&invoke-error program: "go" arguments: ("test" "-v" "-race" "./...") exit-status: 2 term-signal: #f stop-signal: #f>
phase `check' failed after 0.0 seconds
command "go" "test" "-v" "-race" "./..." failed with status 2

Some deprecated features have been used.  Set the environment
variable GUILE_WARN_DEPRECATED to "detailed" and rerun the
program to get more information.  Set it to "no" to suppress
this message.
builder for `/gnu/store/yzsp67aknljfl8q1kcymx10gcfzpvacm-nsq-1.3.0.drv' failed with exit code 1
@ build-failed /gnu/store/yzsp67aknljfl8q1kcymx10gcfzpvacm-nsq-1.3.0.drv - 1 builder for `/gnu/store/yzsp67aknljfl8q1kcymx10gcfzpvacm-nsq-1.3.0.drv' failed with exit code 1

*** Log tail
#+begin_src sh :results value raw output replace :exports results
curl -s https://ci.guix.gnu.org/build/3338535/log/raw | zcat | tail -n20
#+end_src

#+RESULTS:
Message: Python module [1mlxml[0m >= 4.5.0 found: [32mYES[0m 4.9.1 None
Message: Python module [1mgi[0m >= 3.38.0 found: [32mYES[0m 3.42.2 None
Message: Python module [1mGLib[0m >= 2.66.0 found: [32mYES[0m 2.72.3 None
Message: Python module [1mGtk[0m >= 3.24.0 found: [32mYES[0m 3.24.37 3.0
Message: Python module [1mGtk[0m >= 4.0.0 found: [32mYES[0m 4.8.1 4.0
Message: Python module [1mWebKit2[0m >= 2.32.0 found: [31mNO[0m  4.1
Message: Python module [1mWebKit[0m >= 2.32.0 found: [32mYES[0m 2.42.3 6.0
Message: Python module [1mGtkSource[0m  found: [32mYES[0m  4
Message: Python module [1mHandy[0m  found: [32mYES[0m  None
Message: Python module [1mAdw[0m  found: [32mYES[0m 1.2.0 None

../source/meson.build:76:0: ERROR: Assert failed: One or more required modules where not found

A full log can be found at /tmp/guix-build-cambalache-0.12.1.drv-0/build/meson-logs/meson-log.txt
error: in phase 'configure': uncaught exception:
%exception #<&invoke-error program: "meson" arguments: ("setup" "--prefix=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1" "--buildtype=debugoptimized" "-Dc_link_args=-Wl,-rpath=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1/lib" "-Dcpp_link_args=-Wl,-rpath=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1/lib" "/tmp/guix-build-cambalache-0.12.1.drv-0/source") exit-status: 1 term-signal: #f stop-signal: #f>
phase `configure' failed after 3.0 seconds
command "meson" "setup" "--prefix=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1" "--buildtype=debugoptimized" "-Dc_link_args=-Wl,-rpath=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1/lib" "-Dcpp_link_args=-Wl,-rpath=/gnu/store/b7lmzzraiapv8jqjzh9q722m1lxwa7vf-cambalache-0.12.1/lib" "/tmp/guix-build-cambalache-0.12.1.drv-0/source" failed with status 1
builder for `/gnu/store/ip3p7ri18789mgvxvrsinwb5m189yp6c-cambalache-0.12.1.drv' failed with exit code 1
@ build-failed /gnu/store/ip3p7ri18789mgvxvrsinwb5m189yp6c-cambalache-0.12.1.drv - 1 builder for `/gnu/store/ip3p7ri18789mgvxvrsinwb5m189yp6c-cambalache-0.12.1.drv' failed with exit code 1
*** Log tail
#+begin_src sh :results value raw output replace :exports results
curl -s https://ci.guix.gnu.org/build/3239202/log/raw | zcat | tail -n20
#+end_src

#+RESULTS:
22: (ASDF/OPERATE:LOAD-SYSTEM "fast-generic-functions")
23: (SB-INT:SIMPLE-EVAL-IN-LEXENV (ASDF/OPERATE:LOAD-SYSTEM "fast-generic-functions") #<NULL-LEXENV>)
24: (EVAL (ASDF/OPERATE:LOAD-SYSTEM "fast-generic-functions"))
25: (SB-IMPL::PROCESS-EVAL/LOAD-OPTIONS ((:EVAL . "(require :asdf)") (:EVAL . #<(SIMPLE-ARRAY CHARACTER (286)) (asdf:initialize-source-registry (list :source-registry (list :tree (uiop:ensure-pathname "/gnu/store/7hvyp0lc11ck4fxchm5hz4d83m4zsr8h-sbcl-fast-generic-functions-0.0.0-1.9c307cd/share/common-lisp/sbc... {100147059F}>) (:EVAL . "(asdf:load-system \"fast-generic-functions\")") (:QUIT)))
26: (SB-IMPL::TOPLEVEL-INIT)
27: ((FLET SB-UNIX::BODY :IN SB-IMPL::START-LISP))
28: ((FLET "WITHOUT-INTERRUPTS-BODY-3" :IN SB-IMPL::START-LISP))
29: (SB-IMPL::%START-LISP)

unhandled condition in --disable-debugger mode, quitting
;
; compilation unit aborted
;   caught 2 fatal ERROR conditions
;   caught 1 ERROR condition
error: in phase 'build': uncaught exception:
%exception #<&invoke-error program: "/gnu/store/70cckrc5b2y7d86ig49llxkaf014fc6l-sbcl-2.4.0/bin/sbcl" arguments: ("--non-interactive" "--eval" "(require :asdf)" "--eval" "(asdf:initialize-source-registry (list :source-registry (list :tree (uiop:ensure-pathname \"/gnu/store/7hvyp0lc11ck4fxchm5hz4d83m4zsr8h-sbcl-fast-generic-functions-0.0.0-1.9c307cd/share/common-lisp/sbcl/fast-generic-functions\" :truenamize t :ensure-directory t)) :inherit-configuration))" "--eval" "(asdf:load-system \"fast-generic-functions\")") exit-status: 1 term-signal: #f stop-signal: #f>
phase `build' failed after 0.4 seconds
command "/gnu/store/70cckrc5b2y7d86ig49llxkaf014fc6l-sbcl-2.4.0/bin/sbcl" "--non-interactive" "--eval" "(require :asdf)" "--eval" "(asdf:initialize-source-registry (list :source-registry (list :tree (uiop:ensure-pathname \"/gnu/store/7hvyp0lc11ck4fxchm5hz4d83m4zsr8h-sbcl-fast-generic-functions-0.0.0-1.9c307cd/share/common-lisp/sbcl/fast-generic-functions\" :truenamize t :ensure-directory t)) :inherit-configuration))" "--eval" "(asdf:load-system \"fast-generic-functions\")" failed with status 1
builder for `/gnu/store/zmdazxx7kz7kzsiqkiyc6mpjx42kyg8c-sbcl-fast-generic-functions-0.0.0-1.9c307cd.drv' failed with exit code 1
@ build-failed /gnu/store/zmdazxx7kz7kzsiqkiyc6mpjx42kyg8c-sbcl-fast-generic-functions-0.0.0-1.9c307cd.drv - 1 builder for `/gnu/store/zmdazxx7kz7kzsiqkiyc6mpjx42kyg8c-sbcl-fast-generic-functions-0.0.0-1.9c307cd.drv' failed with exit code 1

** TODO 20250821205105-guix-guix-pulls-2000


- [X] packages [5/5][100%]
  - [X] python-edps
  - [X] python-pyesorex
  - [X] python-pycpl
  - [X] esorex
  - [X] cpl
#+begin_src scheme
(define %eso-pipelines-url "https://ftp.eso.org/pub/dfs/pipelines/libraries")
(define* (eso-pipeline-source #:key name version sha256-base32-hash)
  "This URL construction provides access to European Southern Observatory
(ESO) pipeline software including:

@itemize
@item adari-core
@item adari
@item adari_core
@item cext
@item cfitsio
@item clapack
@item cpl - Common Pipeline Library for astronomical data reduction
@item edps - @acronym{European Southern Observatory,ESO} Data Processing System
@item edpsgui
@item edpsplot
@item erfa
@item esorex - The European Southern Observatory Recipe Execution Tool
@item fftw
@item fitsverify
@item fv
@item grpc
@item gsl
@item hdrl
@item molecfit_third_party
@item pycpl - Python Language Bindings for @acronym{Common Pipeline Library,CPL}
@item pyesorex - Command line tool which can serve as a drop-in replacement of EsoRex
@item telluriccorr
@item wcslib
@item yorick
@end itemize"
  (origin
    (method url-fetch)
    (uri
     (format #f "~a/~a/~a-~a.tar.gz" %eso-pipelines-url name name version))
    (sha256
     (base32 sha256-base32-hash))))
#+end_src

#+RESULTS:
: #<unspecified>
